In [1]:
import numpy as np
import pandas as pd

In [2]:
dict1 = {
    "name" : ["Harry", "Rohan", "Ali"],
    "marks": [10,20,30]
}

In [3]:
print(dict1)

{'name': ['Harry', 'Rohan', 'Ali'], 'marks': [10, 20, 30]}

In [4]:
df = pd.DataFrame(dict1)

In [5]:
df

    name  marks
0  Harry     10
1  Rohan     20
2    Ali     30

In [6]:
# Export to CSV
df.to_csv('file.csv')
# Export without index
df.to_csv('without_index_file.csv', index=False)

In [7]:
# Preview first n rows
df.head(3)

    name  marks
0  Harry     10
1  Rohan     20
2    Ali     30

In [8]:
# Preview last n rows
df.tail(2)

    name  marks
1  Rohan     20
2    Ali     30

In [9]:
# Describe: Provide statistical information
df.describe()

       marks
count    3.0
mean    20.0
std     10.0
min     10.0
25%     15.0
50%     20.0
75%     25.0
max     30.0

# Importing Data from CSV

In [10]:
data = pd.read_csv('./data/winemag-data_first150k.csv')

In [11]:
data

,Unnamed: 0,country,description,designation,points,price,province,region_1,region_2,variety,winery
0,0,US,This tremendous 100% varietal wine hails from ...,Martha's Vineyard,96,235.0,California,Napa Valley,Napa,Cabernet Sauvignon,Heitz
1,1,Spain,"Ripe aromas of fig, blackberry and cassis are ...",Carodorum Selección Especial Reserva,96,110.0,Northern Spain,Toro,NaN,Tinta de Toro,Bodega Carmen Rodríguez
2,2,US,Mac Watson honors the memory of a wine once ma...,Special Selected Late Harvest,96,90.0,California,Knights Valley,Sonoma,Sauvignon Blanc,Macauley
3,3,US,"This spent 20 months in 30% new French oak, an...",Reserve,96,65.0,Oregon,Willamette Valley,Willamette Valley,Pinot Noir,Ponzi
4,4,France,"This is the top wine from La Bégude, named aft...",La Brûlade,95,66.0,Provence,Bandol,NaN,Provence red blend,Domaine de la Bégude
...,...,...,...,...,...,...,...,...,...,...,...
150925,150925,Italy,Many people feel Fiano represents southern Ita...,NaN,91,20.0,Southern Italy,Fiano di Avellino,NaN,White Blend,Feudi di San Gregorio
150926,150926,France,"Offers an intriguing nose with ginger, lime an...",Cuvée Prestige,91,27.0,Champagne,Champagne,NaN,Champagne Blend,H.Germain
150927,150927,Italy,This classic example comes from a cru vineyard...,Terre di Dora,91,20.0,Southern Italy,Fiano di Avellino,NaN,White Blend,Terredora
150928,150928,France,"A perfect salmon shade, with scents of peaches...",Grand Brut Rosé,90,52.0,Champagne,Champagne,NaN,Champagne Blend,Gosset
150929,150929,Italy,More Pinot Grigios should taste like this. A r...,NaN,90,15.0,Northeastern Italy,Alto Adige,NaN,Pinot Grigio,Alois Lageder

In [12]:
# Print Specific Column
data.country

0             US
1          Spain
2             US
3             US
4         France
           ...
150925     Italy
150926    France
150927     Italy
150928    France
150929     Italy
Name: country, Length: 150930, dtype: object

In [13]:
# Print a Single Value
# Print First Record from the Country Series
data.country[0]

'US'

In [14]:
# Change Index Values
# data.index = ['index_1', 'index_2', 'index_3']

# Series

In [15]:
series = pd.Series(np.random.rand(34))

In [16]:
series

0     0.941891
1     0.166783
2     0.935563
3     0.167580
4     0.862980
5     0.202684
6     0.528161
7     0.327895
8     0.371110
9     0.264088
10    0.878312
11    0.985431
12    0.838569
13    0.715506
14    0.533566
15    0.782868
16    0.612066
17    0.824448
18    0.948561
19    0.431642
20    0.146139
21    0.691007
22    0.157850
23    0.191726
24    0.515116
25    0.633078
26    0.732380
27    0.044948
28    0.673861
29    0.765513
30    0.024069
31    0.415974
32    0.899741
33    0.685809
dtype: float64

In [17]:
type(series)

pandas.core.series.Series

# Data Frame

In [18]:
new_data_frame = pd.DataFrame(np.random.rand(334, 5), index = np.arange(334))
new_data_frame

            0         1         2         3         4
0    0.897407  0.058231  0.828403  0.645409  0.714960
1    0.875096  0.163784  0.912980  0.103238  0.222512
2    0.926726  0.864239  0.825519  0.337132  0.848867
3    0.789378  0.736826  0.885072  0.717799  0.498275
4    0.531035  0.872760  0.239729  0.055932  0.315788
..        ...       ...       ...       ...       ...
329  0.731512  0.629534  0.957361  0.042431  0.943622
330  0.255500  0.376677  0.983048  0.661902  0.992470
331  0.118202  0.250459  0.162676  0.702767  0.153833
332  0.585093  0.028558  0.288871  0.171459  0.203818
333  0.083229  0.308342  0.680057  0.408337  0.415693

[334 rows x 5 columns]

In [19]:
type(new_data_frame)

pandas.core.frame.DataFrame

In [20]:
new_data_frame.describe()

                0           1           2           3           4
count  334.000000  334.000000  334.000000  334.000000  334.000000
mean     0.500500    0.510271    0.507376    0.493857    0.489129
std      0.290384    0.282327    0.286143    0.300178    0.292606
min      0.000089    0.007187    0.003144    0.001185    0.003440
25%      0.246429    0.290144    0.256376    0.207113    0.247277
50%      0.500363    0.496167    0.498284    0.507956    0.476659
75%      0.762418    0.747361    0.745014    0.751801    0.739971
max      0.995150    0.994968    0.995632    0.997064    0.997028

In [21]:
new_data_frame.dtypes

0    float64
1    float64
2    float64
3    float64
4    float64
dtype: object

In [22]:
new_data_frame.head()

          0         1         2         3         4
0  0.897407  0.058231  0.828403  0.645409  0.714960
1  0.875096  0.163784  0.912980  0.103238  0.222512
2  0.926726  0.864239  0.825519  0.337132  0.848867
3  0.789378  0.736826  0.885072  0.717799  0.498275
4  0.531035  0.872760  0.239729  0.055932  0.315788

In [23]:
new_data_frame[0][0] = "Random Name"

C:\Users\UsEr\AppData\Local\Temp\ipykernel_17012\2778953244.py:1: FutureWarning: ChainedAssignmentError: behaviour will change in pandas 3.0!
You are setting values through chained assignment. Currently this works in certain cases, but when using Copy-on-Write (which will become the default behaviour in pandas 3.0) this will never work to update the original DataFrame or Series, because the intermediate object on which we are setting values will behave as a copy.
A typical example is when you are setting values in a column of a DataFrame, like:

df["col"][row_indexer] = value

Use `df.loc[row_indexer, "col"] = values` instead, to perform the assignment in a single step and ensure this keeps updating the original `df`.

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy

  new_data_frame[0][0] = "Random Name"
C:\Users\UsEr\AppData\Local\Temp\ipykernel_17012\2778953244.py:1: FutureWarning: Setting an item of incompatible dtype is deprecated and will raise an error in a future version of pandas. Value 'Random Name' has dtype incompatible with float64, please explicitly cast to a compatible dtype first.
  new_data_frame[0][0] = "Random Name"

In [24]:
new_data_frame.head()

             0         1         2         3         4
0  Random Name  0.058231  0.828403  0.645409  0.714960
1     0.875096  0.163784  0.912980  0.103238  0.222512
2     0.926726  0.864239  0.825519  0.337132  0.848867
3     0.789378  0.736826  0.885072  0.717799  0.498275
4     0.531035  0.872760  0.239729  0.055932  0.315788

In [25]:
new_data_frame.dtypes

0     object
1    float64
2    float64
3    float64
4    float64
dtype: object

In [26]:
new_data_frame.index

Index([  0,   1,   2,   3,   4,   5,   6,   7,   8,   9,
       ...
       324, 325, 326, 327, 328, 329, 330, 331, 332, 333],
      dtype='int32', length=334)

In [27]:
new_data_frame.columns

RangeIndex(start=0, stop=5, step=1)

In [28]:
new_data_frame.head()

             0         1         2         3         4
0  Random Name  0.058231  0.828403  0.645409  0.714960
1     0.875096  0.163784  0.912980  0.103238  0.222512
2     0.926726  0.864239  0.825519  0.337132  0.848867
3     0.789378  0.736826  0.885072  0.717799  0.498275
4     0.531035  0.872760  0.239729  0.055932  0.315788

In [29]:
new_data_frame.to_numpy()
new_data_frame[0][0] = 0.3
new_data_frame

            0         1         2         3         4
0         0.3  0.058231  0.828403  0.645409  0.714960
1    0.875096  0.163784  0.912980  0.103238  0.222512
2    0.926726  0.864239  0.825519  0.337132  0.848867
3    0.789378  0.736826  0.885072  0.717799  0.498275
4    0.531035  0.872760  0.239729  0.055932  0.315788
..        ...       ...       ...       ...       ...
329  0.731512  0.629534  0.957361  0.042431  0.943622
330    0.2555  0.376677  0.983048  0.661902  0.992470
331  0.118202  0.250459  0.162676  0.702767  0.153833
332  0.585093  0.028558  0.288871  0.171459  0.203818
333  0.083229  0.308342  0.680057  0.408337  0.415693

[334 rows x 5 columns]

In [30]:
new_data_frame.T

,0,1,2,3,4,5,6,7,8,9,...,324,325,326,327,328,329,330,331,332,333
0,0.3,0.875096,0.926726,0.789378,0.531035,0.24278,0.102726,0.790833,0.866794,0.126252,...,0.624965,0.963923,0.308652,0.563411,0.187178,0.731512,0.2555,0.118202,0.585093,0.083229
1,0.058231,0.163784,0.864239,0.736826,0.87276,0.446339,0.51946,0.267074,0.319681,0.935834,...,0.453871,0.796955,0.116258,0.697528,0.206252,0.629534,0.376677,0.250459,0.028558,0.308342
2,0.828403,0.91298,0.825519,0.885072,0.239729,0.547182,0.966207,0.587485,0.611827,0.649401,...,0.904049,0.976957,0.82218,0.967685,0.885465,0.957361,0.983048,0.162676,0.288871,0.680057
3,0.645409,0.103238,0.337132,0.717799,0.055932,0.655089,0.898998,0.752784,0.732206,0.274122,...,0.406615,0.79591,0.188581,0.194828,0.495686,0.042431,0.661902,0.702767,0.171459,0.408337
4,0.71496,0.222512,0.848867,0.498275,0.315788,0.131766,0.591499,0.918197,0.315312,0.971579,...,0.148639,0.780565,0.491348,0.371311,0.658764,0.943622,0.99247,0.153833,0.203818,0.415693

In [31]:

new_data_frame.sort_index(axis=1 , ascending=False)

            4         3         2         1         0
0    0.714960  0.645409  0.828403  0.058231       0.3
1    0.222512  0.103238  0.912980  0.163784  0.875096
2    0.848867  0.337132  0.825519  0.864239  0.926726
3    0.498275  0.717799  0.885072  0.736826  0.789378
4    0.315788  0.055932  0.239729  0.872760  0.531035
..        ...       ...       ...       ...       ...
329  0.943622  0.042431  0.957361  0.629534  0.731512
330  0.992470  0.661902  0.983048  0.376677    0.2555
331  0.153833  0.702767  0.162676  0.250459  0.118202
332  0.203818  0.171459  0.288871  0.028558  0.585093
333  0.415693  0.408337  0.680057  0.308342  0.083229

[334 rows x 5 columns]

# Sorting

Use axis = 0 for Row
Use axis = 1 for Column

In [32]:

new_data_frame.sort_index(axis=1 , ascending=False)

            4         3         2         1         0
0    0.714960  0.645409  0.828403  0.058231       0.3
1    0.222512  0.103238  0.912980  0.163784  0.875096
2    0.848867  0.337132  0.825519  0.864239  0.926726
3    0.498275  0.717799  0.885072  0.736826  0.789378
4    0.315788  0.055932  0.239729  0.872760  0.531035
..        ...       ...       ...       ...       ...
329  0.943622  0.042431  0.957361  0.629534  0.731512
330  0.992470  0.661902  0.983048  0.376677    0.2555
331  0.153833  0.702767  0.162676  0.250459  0.118202
332  0.203818  0.171459  0.288871  0.028558  0.585093
333  0.415693  0.408337  0.680057  0.308342  0.083229

[334 rows x 5 columns]

In [33]:
new_data_frame.head()

          0         1         2         3         4
0       0.3  0.058231  0.828403  0.645409  0.714960
1  0.875096  0.163784  0.912980  0.103238  0.222512
2  0.926726  0.864239  0.825519  0.337132  0.848867
3  0.789378  0.736826  0.885072  0.717799  0.498275
4  0.531035  0.872760  0.239729  0.055932  0.315788

In [34]:
type(new_data_frame[0])

pandas.core.series.Series

In [35]:
newdf2 = new_data_frame
newdf2[0][0]= 934347

In [36]:
new_data_frame

            0         1         2         3         4
0      934347  0.058231  0.828403  0.645409  0.714960
1    0.875096  0.163784  0.912980  0.103238  0.222512
2    0.926726  0.864239  0.825519  0.337132  0.848867
3    0.789378  0.736826  0.885072  0.717799  0.498275
4    0.531035  0.872760  0.239729  0.055932  0.315788
..        ...       ...       ...       ...       ...
329  0.731512  0.629534  0.957361  0.042431  0.943622
330    0.2555  0.376677  0.983048  0.661902  0.992470
331  0.118202  0.250459  0.162676  0.702767  0.153833
332  0.585093  0.028558  0.288871  0.171459  0.203818
333  0.083229  0.308342  0.680057  0.408337  0.415693

[334 rows x 5 columns]

# Copying the DataFrame Right Way

In [37]:
df3 = new_data_frame.copy()
df3.head()

          0         1         2         3         4
0    934347  0.058231  0.828403  0.645409  0.714960
1  0.875096  0.163784  0.912980  0.103238  0.222512
2  0.926726  0.864239  0.825519  0.337132  0.848867
3  0.789378  0.736826  0.885072  0.717799  0.498275
4  0.531035  0.872760  0.239729  0.055932  0.315788

In [38]:
df3[0][0] = 9
new_data_frame.head()

C:\Users\UsEr\AppData\Local\Temp\ipykernel_17012\3125743126.py:1: FutureWarning: ChainedAssignmentError: behaviour will change in pandas 3.0!
You are setting values through chained assignment. Currently this works in certain cases, but when using Copy-on-Write (which will become the default behaviour in pandas 3.0) this will never work to update the original DataFrame or Series, because the intermediate object on which we are setting values will behave as a copy.
A typical example is when you are setting values in a column of a DataFrame, like:

df["col"][row_indexer] = value

Use `df.loc[row_indexer, "col"] = values` instead, to perform the assignment in a single step and ensure this keeps updating the original `df`.

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy

  df3[0][0] = 9
C:\Users\UsEr\AppData\Local\Temp\ipykernel_17012\3125743126.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df3[0][0] = 9

          0         1         2         3         4
0    934347  0.058231  0.828403  0.645409  0.714960
1  0.875096  0.163784  0.912980  0.103238  0.222512
2  0.926726  0.864239  0.825519  0.337132  0.848867
3  0.789378  0.736826  0.885072  0.717799  0.498275
4  0.531035  0.872760  0.239729  0.055932  0.315788

In [39]:
df3.head()

          0         1         2         3         4
0         9  0.058231  0.828403  0.645409  0.714960
1  0.875096  0.163784  0.912980  0.103238  0.222512
2  0.926726  0.864239  0.825519  0.337132  0.848867
3  0.789378  0.736826  0.885072  0.717799  0.498275
4  0.531035  0.872760  0.239729  0.055932  0.315788

# Loc

We can access a specific column by row and column. Row and

In [40]:
df3.loc[0,0] = 654
df3.head()

          0         1         2         3         4
0       654  0.058231  0.828403  0.645409  0.714960
1  0.875096  0.163784  0.912980  0.103238  0.222512
2  0.926726  0.864239  0.825519  0.337132  0.848867
3  0.789378  0.736826  0.885072  0.717799  0.498275
4  0.531035  0.872760  0.239729  0.055932  0.315788

## Updating Colmn Label

In [41]:
df3.columns = list("ABCDE")
df3.head()

          A         B         C         D         E
0       654  0.058231  0.828403  0.645409  0.714960
1  0.875096  0.163784  0.912980  0.103238  0.222512
2  0.926726  0.864239  0.825519  0.337132  0.848867
3  0.789378  0.736826  0.885072  0.717799  0.498275
4  0.531035  0.872760  0.239729  0.055932  0.315788

## Accesing unavailable columns creates a new columns

In [42]:
df3.loc[0,0] = 654
df3.head(3)

          A         B         C         D         E      0
0       654  0.058231  0.828403  0.645409  0.714960  654.0
1  0.875096  0.163784  0.912980  0.103238  0.222512    NaN
2  0.926726  0.864239  0.825519  0.337132  0.848867    NaN

In [43]:
df3.loc[0, 'A'] = 654
df3.head(3)

          A         B         C         D         E      0
0       654  0.058231  0.828403  0.645409  0.714960  654.0
1  0.875096  0.163784  0.912980  0.103238  0.222512    NaN
2  0.926726  0.864239  0.825519  0.337132  0.848867    NaN

# Drop Column/Row
axis = 1 is equivilent to column
axis = 0 is equivilent to row

In [44]:
df3 = df3.drop((0,0), axis=1)
df3.head()

KeyError: '[(0, 0)] not found in axis'

In [ ]:
df3 = df3.drop(0, axis=1)
df3.head()

# Accessing Specific Rows & Columns
df3.loc[rows, columns]

In [ ]:
df3.loc[[1,2], ['A', 'E']]

In [ ]:
df3.loc[[1,2], ['A', 'E']]

In [ ]:
df3.head()

In [ ]:
df3.loc[:, :]

In [ ]:
df3.loc[[1,2], :]

In [ ]:
df3.loc[(df3['A'] < 0.3)]

In [ ]:
df3.loc[(df3['A'] < 0.3) & df3['C'] > 0.1]

# iLoc - Use when want to use Index
Use iloc when want to retrive based on index.
For example accessing df3.iloc[row, column]
This gives a specific value.

In [ ]:
df3.iloc[0,4]

In [ ]:
df3.iloc[[0,5],[0,4]]

In [ ]:
df3.iloc[:,:]

In [ ]:
df3.iloc[[0,5],:]

In [ ]:
df3.drop([0])

In [ ]:
df3.drop(['A', 0], axis=1, inplace=True)

In [ ]:
df3.drop(['A', 0], axis=1)

## Inplace - Update the Origional One
For example `df3 = df3.drop(['A'], axis=1)`

In [ ]:
df3.drop(['A', 0], axis=1, inplace=True)

# Reset Index
It resets the indexes to start from 1
`drop=True` means drop the current index column
`inplace` means update the origional dataframe

In [ ]:
df3.reset_index(drop = True, inplace=True)

In [ ]:
df3

# Is Null

In [ ]:
df3['B'].isnull()

# Update Value to None

In [ ]:
df3['B'] = None

In [ ]:
df3

In [ ]:
df3.loc[:, ['B']] = None

In [ ]:
df3

In [ ]:
df3['B'].isnull()

# Dropna

In [57]:
df = pd.DataFrame({"name": ['Alfred', 'Batman', 'Catwoman', 'Alfred'],

                   "toy": [np.nan, 'Batmobile', 'Bullwhip', np.nan],

                   "born": [pd.NaT, pd.Timestamp("1940-04-25"),

                            pd.NaT, pd.NaT]})

In [ ]:
df.dropna()

In [45]:
# Remove Column by defining axis = 1
df.dropna(how='all', axis=1)

    name  marks
0  Harry     10
1  Rohan     20
2    Ali     30

# Drop Duplicates

In [58]:
df.drop_duplicates()

       name        toy       born
0    Alfred        NaN        NaT
1    Batman  Batmobile 1940-04-25
2  Catwoman   Bullwhip        NaT

In [59]:
df.drop_duplicates(subset=['name'], keep=False)

       name        toy       born
1    Batman  Batmobile 1940-04-25
2  Catwoman   Bullwhip        NaT

# Shape

In [61]:
df.shape

(4, 3)

# Info

In [62]:
df.info

<bound method DataFrame.info of        name        toy       born
0    Alfred        NaN        NaT
1    Batman  Batmobile 1940-04-25
2  Catwoman   Bullwhip        NaT
3    Alfred        NaN        NaT>

# Value Counts

In [65]:
df['name'].value_counts()

name
Alfred      2
Batman      1
Catwoman    1
Name: count, dtype: int64

# Count Unique

In [68]:
df['name'].value_counts(dropna=True)

name
Alfred      2
Batman      1
Catwoman    1
Name: count, dtype: int64

In [69]:
df.isnull()

    name    toy   born
0  False   True   True
1  False  False  False
2  False  False   True
3  False   True   True

In [70]:
df.describe()

                      born
count                    1
mean   1940-04-25 00:00:00
min    1940-04-25 00:00:00
25%    1940-04-25 00:00:00
50%    1940-04-25 00:00:00
75%    1940-04-25 00:00:00
max    1940-04-25 00:00:00

In [ ]:
df.mean(axis=1)
df.corr()
df.count()
df.max()
df.min()
df.median()
df.std()